1
//обьясни своими словами что такое 'Подьем' в javascript

//это стандартное поведение JavaScript, заключающееся в перемещении объявлений наверх.

2
//можно ли использовать let перед ее обьявлением?

//приведет к ReferenceError (ошибке).

3
//можно ли использовать const перед ее обьявлением?

//приведет к ReferenceError (ошибке).

4
//что такое 'use strict'

5
//можно ли использовать в строгом режиме необьявленные переменные?

6
//где нужно писать 'use strict'?

// В начале

7
//запрещено ли использовать переменную без обьявления в строгом режиме?

8
//запрещено ли использовать обьект без обьявления в строгом режиме?

9
//запрещено ли удалять переменную/обьект без обьявления в строгом режиме?

10
//запрещено ли удалять функцию строгом режиме?

11
//запрещено ли создавать одинаковые переменные в строгом режиме?